; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	satellite2 - satellite
	instrument2 - instrument
	infrared2 - mode
	spectrograph0 - mode
	image1 - mode
	Star0 - direction
	Star3 - direction
	GroundStation4 - direction
	GroundStation2 - direction
	GroundStation1 - direction
	Phenomenon5 - direction
	Planet6 - direction
	Planet7 - direction
	Star8 - direction
	Phenomenon9 - direction
	Planet10 - direction
	Star11 - direction
)
(:init
	(supports instrument0 image1)
	(supports instrument0 infrared2)
	(calibration_target instrument0 GroundStation2)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet6)
	(supports instrument1 image1)
	(supports instrument1 spectrograph0)
	(supports instrument1 infrared2)
	(calibration_target instrument1 GroundStation1)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation2)
	(supports instrument2 spectrograph0)
	(supports instrument2 image1)
	(calibration_target instrument2 GroundStation1)
	(on_board instrument2 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Phenomenon5)
)
(:goal (and
	(have_image Phenomenon5 image1)
	(have_image Planet6 spectrograph0)
	(have_image Planet7 spectrograph0)
	(have_image Star8 infrared2)
	(have_image Phenomenon9 spectrograph0)
	(have_image Planet10 infrared2)
	(have_image Star11 image1)
))

)

; plan
1. (turn_to satellite1 groundstation1 groundstation2)
   deleted: (pointing satellite1 groundstation2)
   added: (pointing satellite1 groundstation1)
   goals met: 0 of 7
2. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 0 of 7
3. (calibrate satellite1 instrument1 groundstation1)
   added: (calibrated instrument1)
   goals met: 0 of 7
4. (turn_to satellite1 planet10 groundstation1)
   deleted: (pointing satellite1 groundstation1)
   added: (pointing satellite1 planet10)
   goals met: 0 of 7
5. (take_image satellite1 planet10 instrument1 infrared2)
   added: (have_image planet10 infrared2)
   goals met: 1 of 7
6. (turn_to satellite1 phenomenon9 planet10)
   deleted: (pointing satellite1 planet10)
   added: (pointing satellite1 phenomenon9)
   goals met: 1 of 7
7. (take_image satellite1 phenomenon9 instrument1 spectrograph0)
   added: (have_image phenomenon9 spectrograph0)
   goals met: 2 of 7
8. (turn_to satellite1 phenomenon5 phenomenon9)
   deleted: (pointing satellite1 phenomenon9)
   added: (pointing satellite1 phenomenon5)
   goals met: 2 of 7
9. (take_image satellite1 phenomenon5 instrument1 image1)
   added: (have_image phenomenon5 image1)
   goals met: 3 of 7
10. (turn_to satellite1 planet6 phenomenon5)
   deleted: (pointing satellite1 phenomenon5)
   added: (pointing satellite1 planet6)
   goals met: 3 of 7
11. (take_image satellite1 planet6 instrument1 spectrograph0)
   added: (have_image planet6 spectrograph0)
   goals met: 4 of 7
12. (turn_to satellite1 planet7 planet6)
   deleted: (pointing satellite1 planet6)
   added: (pointing satellite1 planet7)
   goals met: 4 of 7
13. (take_image satellite1 planet7 instrument1 spectrograph0)
   added: (have_image planet7 spectrograph0)
   goals met: 5 of 7
14. (turn_to satellite1 star11 planet7)
   deleted: (pointing satellite1 planet7)
   added: (pointing satellite1 star11)
   goals met: 5 of 7
15. (take_image satellite1 star11 instrument1 image1)
   added: (have_image star11 image1)
   goals met: 6 of 7
16. (turn_to satellite1 star8 star11)
   deleted: (pointing satellite1 star11)
   added: (pointing satellite1 star8)
   goals met: 6 of 7
17. (take_image satellite1 star8 instrument1 infrared2)
   added: (have_image star8 infrared2)
   goals met: 7 of 7
